cyber_truck_coarse_mesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flowVelocity    (0 22.22 0);

pressure        0;

turbulentKE     0.24;

turbulentOmega  1.78;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); //(0 -22.22 0);	//-1); 

boundaryField
{
 
        bottom
    {
        type            fixedValue;
        value           uniform (0 22.22 0);     
        
    }

     
        top
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 22.22 0);
    }


        right
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

        RaceCar
    {
        type           noSlip;	//Slip;
    }
   
        back
    {
        type        zeroGradient;
        
    }

        left
    {
        type        zeroGradient;
 
    }

        front
    {
        type        zeroGradient;
    }


    "proc.*"
    {
        type       processor;
    }
}


// ************************************************************************* //
